In [29]:
import pandas as pd

## Data Frames

In [30]:
forum_users = {
    'User ID': [1, 2, 3, 4, 5],
    'Username': ['bogdan_s', 'jane_smith', 'alex_123', 'bob56', 'mark_wilson'],
    'Age': [18, 35, 25, 38, 33],
    'Joined Date': ['2023-01-01', '2023-02-15', '2023-04-25', '2023-06-21', '2023-09-15'],
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID     Username  Age Joined Date  Total Posts  Reputation
0        1     bogdan_s   18  2023-01-01          150         500
1        2   jane_smith   35  2023-02-15          230         720
2        3     alex_123   25  2023-04-25           80         200
3        4        bob56   38  2023-06-21          420         940
4        5  mark_wilson   33  2023-09-15          310         500

In [31]:
df.shape

(5, 6)

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [34]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [35]:
type(df.columns)

pandas.core.indexes.base.Index

In [36]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [37]:
df.dtypes

User ID         int64
Username       object
Age             int64
Joined Date    object
Total Posts     int64
Reputation      int64
dtype: object

In [38]:
df.values

array([[1, 'bogdan_s', 18, '2023-01-01', 150, 500],
       [2, 'jane_smith', 35, '2023-02-15', 230, 720],
       [3, 'alex_123', 25, '2023-04-25', 80, 200],
       [4, 'bob56', 38, '2023-06-21', 420, 940],
       [5, 'mark_wilson', 33, '2023-09-15', 310, 500]], dtype=object)

In [39]:
type(df.values)

numpy.ndarray

In [40]:
df.values[3, 1]

'bob56'

In [41]:
df.head(3)

   User ID    Username  Age Joined Date  Total Posts  Reputation
0        1    bogdan_s   18  2023-01-01          150         500
1        2  jane_smith   35  2023-02-15          230         720
2        3    alex_123   25  2023-04-25           80         200

In [42]:
type(df.head(2))

pandas.core.frame.DataFrame

In [43]:
df.tail(2)

   User ID     Username  Age Joined Date  Total Posts  Reputation
3        4        bob56   38  2023-06-21          420         940
4        5  mark_wilson   33  2023-09-15          310         500

In [45]:
# Важная штука, используется всегда при анализе данных
df.describe().round(2)

       User ID    Age  Total Posts  Reputation
count     5.00   5.00          5.0        5.00
mean      3.00  29.80        238.0      572.00
std       1.58   8.17        133.3      276.62
min       1.00  18.00         80.0      200.00
25%       2.00  25.00        150.0      500.00
50%       3.00  33.00        230.0      500.00
75%       4.00  35.00        310.0      720.00
max       5.00  38.00        420.0      940.00

In [50]:
df.select_dtypes(include='int64')

   User ID  Age  Total Posts  Reputation
0        1   18          150         500
1        2   35          230         720
2        3   25           80         200
3        4   38          420         940
4        5   33          310         500

In [53]:
df.select_dtypes(exclude='int64')

      Username Joined Date
0     bogdan_s  2023-01-01
1   jane_smith  2023-02-15
2     alex_123  2023-04-25
3        bob56  2023-06-21
4  mark_wilson  2023-09-15

In [64]:
import numpy as np
forum_users = {
    'User ID': np.array([1, 2, 3, 4, 5]),
    'Username': ['bogdan_s', 'jane_smith', 'alex_123', 'bob56', 'mark_wilson'],
    'Age': [18, 35, 25, 38, None],
    'Joined Date': pd.to_datetime(['2023-01-01', '2023-02-15', '2023-04-25', '2023-06-21', None]),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s  18.0  2023-01-01          150         500
1        2   jane_smith  35.0  2023-02-15          230         720
2        3     alex_123  25.0  2023-04-25           80         200
3        4        bob56  38.0  2023-06-21          420         940
4        5  mark_wilson   NaN         NaT          310         500

In [ ]:


dd

In [58]:
df.isna()

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False   True         True        False       False

In [59]:
df.isna().sum()

User ID        0
Username       0
Age            1
Joined Date    1
Total Posts    0
Reputation     0
dtype: int64

In [66]:
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

In [62]:
df.values

array([[1, 'bogdan_s', 18.0, Timestamp('2023-01-01 00:00:00'), 150, 500],
       [2, 'jane_smith', 35.0, Timestamp('2023-02-15 00:00:00'), 230,
        720],
       [3, 'alex_123', 25.0, Timestamp('2023-04-25 00:00:00'), 80, 200],
       [4, 'bob56', 38.0, Timestamp('2023-06-21 00:00:00'), 420, 940],
       [5, 'mark_wilson', nan, NaT, 310, 500]], dtype=object)

In [65]:
df.describe().round(2)

       User ID    Age          Joined Date  Total Posts  Reputation
count     5.00   4.00                    4          5.0        5.00
mean      3.00  29.00  2023-03-24 12:00:00        238.0      572.00
min       1.00  18.00  2023-01-01 00:00:00         80.0      200.00
25%       2.00  23.25  2023-02-03 18:00:00        150.0      500.00
50%       3.00  30.00  2023-03-21 12:00:00        230.0      500.00
75%       4.00  35.75  2023-05-09 06:00:00        310.0      720.00
max       5.00  38.00  2023-06-21 00:00:00        420.0      940.00
std       1.58   9.20                  NaN        133.3      276.62

## Series

In [71]:
username_series = df['Username']
username_series

0       bogdan_s
1     jane_smith
2       alex_123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [70]:
type(df['Username'])

pandas.core.series.Series

In [72]:
username_series.values

array(['bogdan_s', 'jane_smith', 'alex_123', 'bob56', 'mark_wilson'],
      dtype=object)

In [73]:
type(username_series.values)

numpy.ndarray

In [74]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [80]:
df['Reputation'].value_counts(ascending=True)

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [83]:
df['Reputation'].unique()

array([500, 720, 200, 940])

In [87]:
df['Username'].sort_values()

2       alex_123
3          bob56
0       bogdan_s
1     jane_smith
4    mark_wilson
Name: Username, dtype: object

In [86]:
df['Username'].sort_values(ascending=False)

4    mark_wilson
1     jane_smith
0       bogdan_s
3          bob56
2       alex_123
Name: Username, dtype: object